# 1. Introduction AI Programming
The program focuses on Python Programming and three main frameworks:

*   Numpy - Data Input and Handling
*   Pandas - Data Manipulation
*   Matplotlib - Data Visualization

# 2. Intro to Python Programming

Python Tips:

*   Python is case sensitive
*   Spacing is important (not very heavy on syntax)
*   Use Error messages

In [1]:
mv_population = 74728 # Assignment operator

# Both statements are equal

x = 2
y = 3
z = 5

x, y, z = 2, 3, 5

int(x)  # int
float(x/y)  # float

print(int(x/y))
print(0.1 + 0.1 + 0.1)  # float is an approximation

0
0.30000000000000004

0
0.30000000000000004

## Data Types and Operators
### Arithmetic Operators

** Exponentiation
// Divides and rounds **down** to the nearest integer

^ is *bitwise XOR*

**Naming** of variables:
* Only use ordinary letters, numbers and underscores. Needs to start with an underscore or letter.
* Can't use reserved words or built-in identifiers.
* The pythonic way to name variables is to use all lowercase letters and underscores to seperate words.

**[PEP 8](https://www.python.org/dev/peps/pep-0008/)** are part of the Python Developer's Guide and the style guidlines

In [2]:
# Exercise to Assignment Operator

# The current volume of a water reservoir (in cubic metres)
reservoir_volume = 4.445e8
# The amount of rainfall from a storm (in cubic metres)
rainfall = 5e6

# decrease the rainfall variable by 10% to account for runoff
rainfall *= 0.9
# add the rainfall variable to the reservoir_volume variable
reservoir_volume += rainfall
# increase reservoir_volume by 5% to account for storm water that flows
# into the reservoir in the days following the storm
reservoir_volume *= 1.05
# decrease reservoir_volume by 5% to account for evaporation
reservoir_volume *= 0.95
# subtract 2.5e5 cubic metres from reservoir_volume to account for water
# that's piped to arid regions.
reservoir_volume -= 2.5e5
# print the new value of the reservoir_volume variable
print(reservoir_volume)

447627500.0

Exceptions = Happens with the execution of the code

Syntax Errors = Checked by python before execution

In [3]:
number = 2
name = "matthias"

print("This is a string with {} two variables {}".format(number, name))

This is a string with 2 two variables matthias

### Lists

* Lists are mutable ordered list of elements
* Lists can contain any mix of different data types

#### Slicing and dicing

* example_List[6:9] - lower bound is inclusive. upper bound is exclusive.
* example_list[:9] - to include the beginning (also works for end)
* "String" (not) in example_List - Output is true or false

In [4]:
example_List = ['january', 'february', 'march', 'april', 'may', 'june', 'july', 'august', 'september', 'october',
                'november', 'december']
print('January' not in example_List)  # in or not in
print(example_List[-1])  # Indexing also works backwards with negative numbers

True
december

#### List functions

* max()
* len()
* min()
* sorted(list, reverse=False) - creates a sorted copy
* append() - appends an element at the end of the list

In [5]:
names = ["Albert", "Carol", "Ben", "Eugenia"]
print(names[1])
names = sorted(names)
print(names[1])

new_str = "\n".join(["hello", "world", "what", "happens"])
print(new_str)

### Tuples

* immutable ordered sequence of elements (for example: latitude, longitude)
* Does not have to be only two values

``
Ankor_Wat = 1.2102, 10491
``

### Sets

* unique elements without any particular ordering
* supports (not) in operator
* .add("Something")
* .pop() - random elements is removed

### Dictionaries and Identy Operators

* Mutable objects that contains a mapping of unique keys to values

#### Dictionaries functions
* in/not in
* elements.get('key') - If you don't know if a key is in the dictionary

is/is not : Identity Operator

In [7]:
elements = {'hydrogen': 1, 'helium': 2}
elements['hydrogen']  # 1
elements.get('krypton', "Error Message to be displayed")

'Error Message to be displayed'

In [8]:
# Nested Dictionaries
elements = {'hydrogen': {'number': 1, 'weight': 1.00794, 'symbol': 'H', 'is_noble_gas': False},
            'helium': {'number': 2, 'weight': 4.002602, 'symbol': 'He', 'is_noble_gas': True}}
# hint: helium is a noble gas, hydrogen isn't

print(elements['hydrogen']['is_noble_gas'])
print(elements['helium']['is_noble_gas'])

False
True

## Control Flow

### IF


* if condition: ...
* if, elif and else

In [9]:
points = 174  # use this input to make your submission

result = None

# write your if statement here
if points <= 50:
	result = "wooden rabbit"
elif points <= 180:
	result = "wafer-thin mint"
elif points <= 200:
	result = "penguin"

if result:
	print("Congratulations! You won a {}!".format(result))
else:
	print("Oh dear, {} this time.".format(result))

Congratulations! You won a wafer-thin mint!

### For Loops

* Iterate over an iterable
* range(start, stop, step)
* for x,y in dict.items()...

### While Loops

* while condition:
* continue - Skip one interation
* break - Break out of the loop

In [10]:
start_num = 1
end_num = 10
count_by = 2

# write a while loop that uses break_num as the ongoing number to 
#   check against end_num
break_num = start_num

while break_num < end_num:
    break_num += count_by
print(break_num)

11

In [11]:
limit = 40
nearest_square = 0
# write your while loop here
while nearest_square**2 < limit:
    nearest_square += 1
    
nearest_square = (nearest_square-1)**2
print(nearest_square)

36

### Zip and Enumerate

* Zip - Returns an interator that combines multiple iterables into a sequence of tuples

In [12]:
test_zip = list(zip(['a', 'b', 'c'], [1, 2, 3])) # [('a', 1), ('b', 2), ('c', 3)]
print(test_zip)

some_list = [('a', 1), ('b', 2), ('c', 3)]
letters, nums = zip(*some_list)  # Unzip

print("letters: {}\nnums: {}".format(letters, nums))

print("--- ENUMERATE ---")

enum_letters = ['a', 'b', 'c', 'd', 'e', 'f', 'g']
for i, l in enumerate(enum_letters):
	print(i, l)

[('a', 1), ('b', 2), ('c', 3)]
letters: ('a', 'b', 'c')
nums: (1, 2, 3)
--- ENUMERATE ---
0 a
1 b
2 c
3 d
4 e
5 f
6 g

In [13]:
x_coord = [23, 53, 2, -12, 95, 103, 14, -5]
y_coord = [677, 233, 405, 433, 905, 376, 432, 445]
z_coord = [4, 16, -6, -42, 3, -6, 23, -1]
labels = ["F", "J", "A", "Q", "Y", "B", "W", "X"]

points = []
# write your for loop here
for coord, label in list(zip((x_coord, y_coord, z_coord), labels)):
	points.append("{}: {}".format(label, coord))

for point in points:
	print(point)

F: [23, 53, 2, -12, 95, 103, 14, -5]
J: [677, 233, 405, 433, 905, 376, 432, 445]
A: [4, 16, -6, -42, 3, -6, 23, -1]

### List Comprehension

* Short form to create a new list

In [14]:
cities = ['new york', 'san francisco', 'berlin', 'munich']

capitalized_cities = [city.title() for city in cities if city == 'berlin']  # if is additional
capitalized_cities_cond = [city if city == 'munich' else city.title() for city in cities]  #if-else examples
print(capitalized_cities_cond)

['New York', 'San Francisco', 'Berlin', 'munich']

## Functions

* breaks programs down in smaller chunks
* reusable parts
* Docstrings to explain the usage of the function

In [15]:
def cylinder_volume(height, radius=5):  # Got a default argument with radius
	"""
	Calculate the cylinder volume
	INPUT
	:param height: int ....
	:param radius: int ....
	OUTPUT 
	:return: int .... 
	"""
	pi = 3.14159
	return height * radius * pi * 2


cylinder_volume(10, 7)  # pass in arguments by position
cylinder_volume(height=10, radius=7)  # pass in arguments by name

439.82259999999997

In [16]:
# Lambda expressions - Anonymous functions

double = lambda x: x * 2
print(double(3))

numbers = [
              [34, 63, 88, 71, 29],
              [90, 78, 51, 27, 45],
              [63, 37, 85, 46, 22],
              [51, 22, 34, 11, 18]
           ]
    
mean = lambda x: sum(x)/len(x)

averages = list(map(mean, numbers))  # map() is a higher-order built-in function that takes a function and iterable as inputs, and returns an iterator that
									#  applies the function to each element of the iterable.
print(averages)

6
[57.0, 58.2, 50.6, 27.2]

#### Iterator
* An object that represents a stream of data

* Iterables are objects that can return one of their elements at a time, such as a list. Many of the built-in functions weâ€™ve used so far, like 'enumerate,' return an iterator.

* An iterator is an object that represents a stream of data. This is different from a list, which is also an iterable, but not an iterator because it is not a stream of data.

```
sq_list = [x**2 for x in range(10)]  # this produces a list of squares

sq_iterator = (x**2 for x in range(10))  # this produces an iterator of squares
```

In [18]:
lessons = ["Why Python Programming", "Data Types and Operators", "Control Flow", "Functions", "Scripting"]

def my_enumerate(iterable, start=0):
    # Implement your generator function here
    for iteration in iterable:
        yield start, iteration
        start += 1

for i, lesson in my_enumerate(lessons, 1):
    print("Lesson {}: {}".format(i, lesson))

Lesson 1: Why Python Programming
Lesson 2: Data Types and Operators
Lesson 3: Control Flow
Lesson 4: Functions
Lesson 5: Scripting

In [21]:
def chunker(iterable, size):
    # Implement function here
    for i in range(0, len(iterable), size):
        yield iterable[i:i + size]
    
    
for chunk in chunker(range(25), 4):
    print(list(chunk))

[0, 1, 2, 3]
[4, 5, 6, 7]
[8, 9, 10, 11]
[12, 13, 14, 15]
[16, 17, 18, 19]
[20, 21, 22, 23]
[24]

## Scripting

needs to be done in a seperate file

* eval() interprets a line as a python line

# 3. NumPy, Pandas and Matplotlib

## NumPy

* Provides Python with extensible Math capabilities
* N dimensional Array object
* Every element in the N dimensional Array has to have the same type

In [23]:
import numpy as np
import time

In [27]:
x = np.random.random(100000000)

In [28]:
start = time.time()
sum(x) / len(x)
print(time.time() - start)

10.059979915618896

In [29]:
start = time.time()
np.mean(x)
print(time.time() - start)

0.13471508026123047

In [30]:
# How to create ndarrays?
# 1. With Numpy np.array() built-in function

y = np.array([1, 2, 3, 4, 5], dtype=np.int64)
print(type(y))  # Type of y
print(y.dtype)  # Data type within the ndarray
print(y.shape)  # Shape of y rows/columns

<class 'numpy.ndarray'>
int64
(5,)

In [31]:
# Saving an ndarray to a file

np.save('AI_Programming_with_Python_Files/test', y)
w = np.load('AI_Programming_with_Python_Files/test.npy')

In [32]:
print(w)

[1 2 3 4 5]

In [33]:
zeros = np.zeros((3,4), dtype=np.int64)  # np.full((3,4), 0)
print(zeros)

[[0 0 0 0]
 [0 0 0 0]
 [0 0 0 0]]

#### Numpy Built-in functions

* shape()
* arange(start, stop], step)
* np.linspace(start, stop, endpoint=True, steps)
* np.eye(shape) = identity matrix
* reshape(ndarray, new_shape) - new_shape has to be compatible to the ndarray.shape
* np.random.random(shape) - Random floats
* np.random.randint(start, stop, size = shape) - int64
* np.random.normal(mean, stdeviation, size = shape)

#### Accessing, Deleting, Inserting Elements into ndarrays

* x[0,...] - Negative indizes can also be used to access elements from the end of the array
* np.delete(ndarray, elements, axis) - axis = 0 (rows) axis = 1 (columns)
* np.append(ndarray, elements, axis) - Adds the elements to the end of the row or column (see 'axis' above)
* np.insert(ndarray, index, elements, axis)
* np.vstack - vertical stacking a matrix on another
* np.hstack - horizontally stacking a matrix on a another

#### Slicing  ndarrays

* ndarray[start:end]
* ndarray[start:]
* ndarray[:end]
* ndarray[1:4, 2:5] - which rows to include (1:4) and which columns (2,5)

**Slicing creates a view of the Array. Meaning that changes affect also the original array!**

* use np.copy() or .copy() to create a copy of the data
* np.diag(ndarray, k) - returns the diagonal of the array. k defines the offset (can be negative)
* np.unique(ndarray) - get unique values out of a ndarray

#### Boolean Indexing, Set Operations and Sorting

* x[x > 10] - boolean indexing
* np.sort(ndarray, axis) - leaves original ndarray as-is. axis decides of sorted by columns (0) or rows (1)
* ndarray.sort(axis) - changes original ndarray

#### Arithmetic operations and Broadcasting

* np.add(x, y) - element-wise adding of x and y (subtract, divide, multiply, power(x,2), exp(), sqrt the same)
* Must have the same shape
* Broadcasting (extending) an array to "fit" the other array

## Pandas

For manipulating and analyzing data in Python:

* Pandas Series
* Pandas DataFrame

Built upon NumPy.

### Pandas Series

In [35]:
# Pandas Series

import pandas as pd
import numpy as np

groceries = pd.Series(data=[30, 10, "yes", "no"], index=["eggs", "apples", "bread", "milk"])  # One dimensional array-like list that can hold different data types
groceries

eggs       30
apples     10
bread     yes
milk       no
dtype: object

In [36]:
print(groceries.shape)  # Shape of pandas series object
print(groceries.ndim)  # Dimension of pandas series object
print(groceries.size)  # Size of pandas series object

print(groceries.values)  # Values of pandas series object
print(groceries.index)  # Indices of pandas series object

(4,)
1
4
[30 10 'yes' 'no']
Index(['eggs', 'apples', 'bread', 'milk'], dtype='object')

In [37]:
'banana' in groceries  # Check if an object is in the pandas series

False

In [38]:
# Accessing pandas series

print(groceries[['eggs', 'milk', 'bread']])  # Accessing with indices
print(groceries[0])  # Accessing with numerical index

print("\n### loc and iloc###\n")

print(groceries.loc[['eggs', 'bread']])  # location
print(groceries.iloc[1])  # integer location

print("\n###drop###\n")

print(groceries.drop('bread'))  # inplace=true to change the actual pandas series
print(groceries)

eggs      30
milk      no
bread    yes
dtype: object
30

### loc and iloc###

eggs      30
bread    yes
dtype: object
10

###drop###

eggs      30
apples    10
milk      no
dtype: object
eggs       30
apples     10
bread     yes
milk       no
dtype: object

In [39]:
# Arithmetic operations on pandas series

fruits = pd.Series(data=[10, 20, 15], index=['bananas', 'apples', 'oranges'])
print("fruits+2 = ", fruits+2)
print("bananas+2 = ", fruits['bananas'] + 2)

print(np.sqrt(fruits))  # Using numpy with the pandas series object

fruits+2 =  bananas    12
apples     22
oranges    17
dtype: int64
bananas+2 =  12
bananas    3.162278
apples     4.472136
oranges    3.872983
dtype: float64

### Pandas DataFrame

In [40]:
# Creating a Pandas DataFrame Object
import pandas as pd

items = {'bob': pd.Series(data=[255, 110, 55, 350], index=['watch', 'ipad', 'macbook', 'homepod']),
         'alice': pd.Series(data=[100, 200, 10, 1000], index=['watch', 'ipad', 'macbook', 'imac'])
         }
type(items)  # dict
print(items['bob']['watch'])

255

In [41]:
shopping_cart = pd.DataFrame(items)
shopping_cart

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>alice</th>
      <th>bob</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>homepod</th>
      <td>NaN</td>
      <td>350.0</td>
    </tr>
    <tr>
      <th>imac</th>
      <td>1000.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>ipad</th>
      <td>200.0</td>
      <td>110.0</td>
    </tr>
    <tr>
      <th>macbook</th>
      <td>10.0</td>
      <td>55.0</td>
    </tr>
    <tr>
      <th>watch</th>
      <td>100.0</td>
      <td>255.0</td>
    </tr>
  </tbody>
</table>
</div>

In [42]:
print("values: ", shopping_cart.values)
print("indices: ", shopping_cart.index)
print("columns: ", shopping_cart.columns)

values:  [[  nan  350.]
 [1000.   nan]
 [ 200.  110.]
 [  10.   55.]
 [ 100.  255.]]
indices:  Index(['homepod', 'imac', 'ipad', 'macbook', 'watch'], dtype='object')
columns:  Index(['alice', 'bob'], dtype='object')

In [43]:
# Accessing the pandas DataFrame
print(shopping_cart[['alice']])

print()

print(shopping_cart['alice']['imac'])

print()

print(shopping_cart.loc[['imac']])

          alice
homepod     NaN
imac     1000.0
ipad      200.0
macbook    10.0
watch     100.0

1000.0

       alice  bob
imac  1000.0  NaN

In [44]:
shopping_cart['dan'] = [1, 2, 3, 4, 5]
shopping_cart

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>alice</th>
      <th>bob</th>
      <th>dan</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>homepod</th>
      <td>NaN</td>
      <td>350.0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>imac</th>
      <td>1000.0</td>
      <td>NaN</td>
      <td>2</td>
    </tr>
    <tr>
      <th>ipad</th>
      <td>200.0</td>
      <td>110.0</td>
      <td>3</td>
    </tr>
    <tr>
      <th>macbook</th>
      <td>10.0</td>
      <td>55.0</td>
      <td>4</td>
    </tr>
    <tr>
      <th>watch</th>
      <td>100.0</td>
      <td>255.0</td>
      <td>5</td>
    </tr>
  </tbody>
</table>
</div>

In [45]:
shopping_cart['new_guy'] = shopping_cart['bob'] + shopping_cart['alice']
shopping_cart

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>alice</th>
      <th>bob</th>
      <th>dan</th>
      <th>new_guy</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>homepod</th>
      <td>NaN</td>
      <td>350.0</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>imac</th>
      <td>1000.0</td>
      <td>NaN</td>
      <td>2</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>ipad</th>
      <td>200.0</td>
      <td>110.0</td>
      <td>3</td>
      <td>310.0</td>
    </tr>
    <tr>
      <th>macbook</th>
      <td>10.0</td>
      <td>55.0</td>
      <td>4</td>
      <td>65.0</td>
    </tr>
    <tr>
      <th>watch</th>
      <td>100.0</td>
      <td>255.0</td>
      <td>5</td>
      <td>355.0</td>
    </tr>
  </tbody>
</table>
</div>

In [46]:
# Dealing with NaN

shopping_cart.isnull().sum()  # 1. sum gives us the sum per column

alice      1
bob        1
dan        0
new_guy    2
dtype: int64

In [47]:
shopping_cart.count()  # Not NaN values

alice      4
bob        4
dan        5
new_guy    3
dtype: int64

In [48]:
shopping_cart.dropna(axis=0)  # axis = 0 drops all rows, axis = 1 drops all columns

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>alice</th>
      <th>bob</th>
      <th>dan</th>
      <th>new_guy</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>ipad</th>
      <td>200.0</td>
      <td>110.0</td>
      <td>3</td>
      <td>310.0</td>
    </tr>
    <tr>
      <th>macbook</th>
      <td>10.0</td>
      <td>55.0</td>
      <td>4</td>
      <td>65.0</td>
    </tr>
    <tr>
      <th>watch</th>
      <td>100.0</td>
      <td>255.0</td>
      <td>5</td>
      <td>355.0</td>
    </tr>
  </tbody>
</table>
</div>

In [49]:
shopping_cart.fillna(0)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>alice</th>
      <th>bob</th>
      <th>dan</th>
      <th>new_guy</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>homepod</th>
      <td>0.0</td>
      <td>350.0</td>
      <td>1</td>
      <td>0.0</td>
    </tr>
    <tr>
      <th>imac</th>
      <td>1000.0</td>
      <td>0.0</td>
      <td>2</td>
      <td>0.0</td>
    </tr>
    <tr>
      <th>ipad</th>
      <td>200.0</td>
      <td>110.0</td>
      <td>3</td>
      <td>310.0</td>
    </tr>
    <tr>
      <th>macbook</th>
      <td>10.0</td>
      <td>55.0</td>
      <td>4</td>
      <td>65.0</td>
    </tr>
    <tr>
      <th>watch</th>
      <td>100.0</td>
      <td>255.0</td>
      <td>5</td>
      <td>355.0</td>
    </tr>
  </tbody>
</table>
</div>

In [50]:
shopping_cart.fillna(method='ffill', axis=1)  # axis = 0 ffills all column, axis = 1 ffills all row

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>alice</th>
      <th>bob</th>
      <th>dan</th>
      <th>new_guy</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>homepod</th>
      <td>NaN</td>
      <td>350.0</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>imac</th>
      <td>1000.0</td>
      <td>1000.0</td>
      <td>2.0</td>
      <td>2.0</td>
    </tr>
    <tr>
      <th>ipad</th>
      <td>200.0</td>
      <td>110.0</td>
      <td>3.0</td>
      <td>310.0</td>
    </tr>
    <tr>
      <th>macbook</th>
      <td>10.0</td>
      <td>55.0</td>
      <td>4.0</td>
      <td>65.0</td>
    </tr>
    <tr>
      <th>watch</th>
      <td>100.0</td>
      <td>255.0</td>
      <td>5.0</td>
      <td>355.0</td>
    </tr>
  </tbody>
</table>
</div>

In [51]:
shopping_cart.interpolate(method='linear', axis=1)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>alice</th>
      <th>bob</th>
      <th>dan</th>
      <th>new_guy</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>homepod</th>
      <td>NaN</td>
      <td>350.0</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>imac</th>
      <td>1000.0</td>
      <td>501.0</td>
      <td>2.0</td>
      <td>2.0</td>
    </tr>
    <tr>
      <th>ipad</th>
      <td>200.0</td>
      <td>110.0</td>
      <td>3.0</td>
      <td>310.0</td>
    </tr>
    <tr>
      <th>macbook</th>
      <td>10.0</td>
      <td>55.0</td>
      <td>4.0</td>
      <td>65.0</td>
    </tr>
    <tr>
      <th>watch</th>
      <td>100.0</td>
      <td>255.0</td>
      <td>5.0</td>
      <td>355.0</td>
    </tr>
  </tbody>
</table>
</div>

#### Loading Data into a pandas DataFrame

In [52]:
google_stock = pd.read_csv('AI_Programming_with_Python_Files/goog-1.csv')
print(google_stock)

            Date        Open        High         Low       Close   Adj Close  \
0     2004-08-19   49.676899   51.693783   47.669952   49.845802   49.845802
1     2004-08-20   50.178635   54.187561   49.925285   53.805050   53.805050
2     2004-08-23   55.017166   56.373344   54.172661   54.346527   54.346527
3     2004-08-24   55.260582   55.439419   51.450363   52.096165   52.096165
4     2004-08-25   52.140873   53.651051   51.604362   52.657513   52.657513
5     2004-08-26   52.135906   53.626213   51.991844   53.606342   53.606342
6     2004-08-27   53.700729   53.959049   52.503513   52.732029   52.732029
7     2004-08-30   52.299839   52.404160   50.675404   50.675404   50.675404
8     2004-08-31   50.819469   51.519913   50.749920   50.854240   50.854240
9     2004-09-01   51.018177   51.152302   49.512966   49.801090   49.801090
10    2004-09-02   49.274517   50.854240   49.150326   50.427021   50.427021
11    2004-09-03   50.148830   50.541279   49.339096   49.681866   49.681866
12    2004-09-07   50.178635   50.670437   49.483158   50.461796   50.461796
13    2004-09-08   50.044510   51.182110   49.925285   50.819469   50.819469
14    2004-09-09   50.933723   51.023144   50.173668   50.824436   50.824436
15    2004-09-10   50.471729   52.935703   50.322701   52.324677   52.324677
16    2004-09-13   52.970478   53.854729   52.886028   53.402668   53.402668
17    2004-09-14   53.377831   55.638126   53.049961   55.384777   55.384777
18    2004-09-15   54.922779   56.745922   54.743942   55.638126   55.638126
19    2004-09-16   55.807030   57.525848   55.464260   56.616764   56.616764
20    2004-09-17   56.840309   58.365391   56.408119   58.365391   58.365391
21    2004-09-20   58.097134   60.407108   58.007717   59.294346   59.294346
22    2004-09-21   59.517895   59.820923   58.375324   58.539257   58.539257
23    2004-09-22   58.320679   59.448345   58.027588   58.807514   58.807514
24    2004-09-23   59.036026   60.918781   58.131908   60.019630   60.019630
25    2004-09-24   60.079243   61.649033   59.493053   59.527828   59.527828
26    2004-09-27   59.393700   60.049435   58.519386   58.747902   58.747902
27    2004-09-28   60.258080   63.288372   59.716602   63.020115   63.020115
28    2004-09-29   62.940632   67.073753   62.707150   65.116478   65.116478
29    2004-09-30   64.530296   65.722542   64.083199   64.381264   64.381264
...          ...         ...         ...         ...         ...         ...
3283  2017-09-01  941.130005  942.479980  935.150024  937.340027  937.340027
3284  2017-09-05  933.080017  937.000000  921.960022  928.450012  928.450012
3285  2017-09-06  930.150024  930.914978  919.270020  927.809998  927.809998
3286  2017-09-07  931.729980  936.409973  923.619995  935.950012  935.950012
3287  2017-09-08  936.489990  936.989990  924.880005  926.500000  926.500000
3288  2017-09-11  934.250000  938.380005  926.919983  929.080017  929.080017
3289  2017-09-12  932.590027  933.479980  923.861023  932.070007  932.070007
3290  2017-09-13  930.659973  937.250000  929.859985  935.090027  935.090027
3291  2017-09-14  931.250000  932.770020  924.000000  925.109985  925.109985
3292  2017-09-15  924.659973  926.489990  916.359985  920.289978  920.289978
3293  2017-09-18  920.010010  922.080017  910.599976  915.000000  915.000000
3294  2017-09-19  917.419983  922.419983  912.549988  921.809998  921.809998
3295  2017-09-20  922.979980  933.880005  922.000000  931.580017  931.580017
3296  2017-09-21  933.000000  936.530029  923.830017  932.450012  932.450012
3297  2017-09-22  927.750000  934.729980  926.479980  928.530029  928.530029
3298  2017-09-25  925.450012  926.400024  909.700012  920.969971  920.969971
3299  2017-09-26  923.719971  930.820007  921.140015  924.859985  924.859985
3300  2017-09-27  927.739990  949.900024  927.739990  944.489990  944.489990
3301  2017-09-28  941.359985  950.690002  940.549988  949.500000  949.500000
3302  2017-09-29  952.000000  959.786011  951.510010  959.109985  959.109985
3303  2017-10-02  959.979980  962.539978  947.840027  953.270020  953.270020
3304  2017-10-03  954.000000  958.000000  949.140015  957.789978  957.789978
3305  2017-10-04  957.000000  960.390015  950.690002  951.679993  951.679993
3306  2017-10-05  955.489990  970.909973  955.179993  969.960022  969.960022
3307  2017-10-06  966.700012  979.460022  963.359985  978.890015  978.890015
3308  2017-10-09  980.000000  985.424988  976.109985  977.000000  977.000000
3309  2017-10-10  980.000000  981.570007  966.080017  972.599976  972.599976
3310  2017-10-11  973.719971  990.710022  972.250000  989.250000  989.250000
3311  2017-10-12  987.450012  994.119995  985.000000  987.830017  987.830017
3312  2017-10-13  992.000000  997.210022  989.000000  989.679993  989.679993

        Volume
0     44994500
1     23005800
2     18393200
3     15361800
4      9257400
5      7148200
6      6258300
7      5235700
8      4954800
9      9206800
10    15232100
11     5191000
12     5891300
13     5023000
14     4092100
15     8764200
16     7902900
17    10910200
18    10793500
19     9335800
20     9543500
21    10708500
22     7282900
23     7638000
24     8599600
25     9191900
26     7119100
27    17056100
28    30745600
29    13861300
...        ...
3283    947400
3284   1326400
3285   1527700
3286   1212700
3287   1011500
3288   1267000
3289   1134400
3290   1102600
3291   1397600
3292   2505400
3293   1306900
3294    936700
3295   1669800
3296   1290600
3297   1052700
3298   1856800
3299   1666900
3300   2239400
3301   1020300
3302   1581000
3303   1283400
3304    888300
3305    952400
3306   1213800
3307   1173900
3308    891400
3309    968400
3310   1693300
3311   1262400
3312   1157700

[3313 rows x 7 columns]

In [53]:
google_stock.describe()  # For statistical information about the dataset / max,mean,min

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Open</th>
      <th>High</th>
      <th>Low</th>
      <th>Close</th>
      <th>Adj Close</th>
      <th>Volume</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>count</th>
      <td>3313.000000</td>
      <td>3313.000000</td>
      <td>3313.000000</td>
      <td>3313.000000</td>
      <td>3313.000000</td>
      <td>3.313000e+03</td>
    </tr>
    <tr>
      <th>mean</th>
      <td>380.186092</td>
      <td>383.493740</td>
      <td>376.519309</td>
      <td>380.072458</td>
      <td>380.072458</td>
      <td>8.038476e+06</td>
    </tr>
    <tr>
      <th>std</th>
      <td>223.818650</td>
      <td>224.974534</td>
      <td>222.473232</td>
      <td>223.853780</td>
      <td>223.853780</td>
      <td>8.399521e+06</td>
    </tr>
    <tr>
      <th>min</th>
      <td>49.274517</td>
      <td>50.541279</td>
      <td>47.669952</td>
      <td>49.681866</td>
      <td>49.681866</td>
      <td>7.900000e+03</td>
    </tr>
    <tr>
      <th>25%</th>
      <td>226.556473</td>
      <td>228.394516</td>
      <td>224.003082</td>
      <td>226.407440</td>
      <td>226.407440</td>
      <td>2.584900e+06</td>
    </tr>
    <tr>
      <th>50%</th>
      <td>293.312286</td>
      <td>295.433502</td>
      <td>289.929291</td>
      <td>293.029114</td>
      <td>293.029114</td>
      <td>5.281300e+06</td>
    </tr>
    <tr>
      <th>75%</th>
      <td>536.650024</td>
      <td>540.000000</td>
      <td>532.409973</td>
      <td>536.690002</td>
      <td>536.690002</td>
      <td>1.065370e+07</td>
    </tr>
    <tr>
      <th>max</th>
      <td>992.000000</td>
      <td>997.210022</td>
      <td>989.000000</td>
      <td>989.679993</td>
      <td>989.679993</td>
      <td>8.276810e+07</td>
    </tr>
  </tbody>
</table>
</div>

In [54]:
google_stock.corr()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Open</th>
      <th>High</th>
      <th>Low</th>
      <th>Close</th>
      <th>Adj Close</th>
      <th>Volume</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Open</th>
      <td>1.000000</td>
      <td>0.999904</td>
      <td>0.999845</td>
      <td>0.999745</td>
      <td>0.999745</td>
      <td>-0.564258</td>
    </tr>
    <tr>
      <th>High</th>
      <td>0.999904</td>
      <td>1.000000</td>
      <td>0.999834</td>
      <td>0.999868</td>
      <td>0.999868</td>
      <td>-0.562749</td>
    </tr>
    <tr>
      <th>Low</th>
      <td>0.999845</td>
      <td>0.999834</td>
      <td>1.000000</td>
      <td>0.999899</td>
      <td>0.999899</td>
      <td>-0.567007</td>
    </tr>
    <tr>
      <th>Close</th>
      <td>0.999745</td>
      <td>0.999868</td>
      <td>0.999899</td>
      <td>1.000000</td>
      <td>1.000000</td>
      <td>-0.564967</td>
    </tr>
    <tr>
      <th>Adj Close</th>
      <td>0.999745</td>
      <td>0.999868</td>
      <td>0.999899</td>
      <td>1.000000</td>
      <td>1.000000</td>
      <td>-0.564967</td>
    </tr>
    <tr>
      <th>Volume</th>
      <td>-0.564258</td>
      <td>-0.562749</td>
      <td>-0.567007</td>
      <td>-0.564967</td>
      <td>-0.564967</td>
      <td>1.000000</td>
    </tr>
  </tbody>
</table>
</div>

In [56]:
google_stock.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Date</th>
      <th>Open</th>
      <th>High</th>
      <th>Low</th>
      <th>Close</th>
      <th>Adj Close</th>
      <th>Volume</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>2004-08-19</td>
      <td>49.676899</td>
      <td>51.693783</td>
      <td>47.669952</td>
      <td>49.845802</td>
      <td>49.845802</td>
      <td>44994500</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2004-08-20</td>
      <td>50.178635</td>
      <td>54.187561</td>
      <td>49.925285</td>
      <td>53.805050</td>
      <td>53.805050</td>
      <td>23005800</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2004-08-23</td>
      <td>55.017166</td>
      <td>56.373344</td>
      <td>54.172661</td>
      <td>54.346527</td>
      <td>54.346527</td>
      <td>18393200</td>
    </tr>
    <tr>
      <th>3</th>
      <td>2004-08-24</td>
      <td>55.260582</td>
      <td>55.439419</td>
      <td>51.450363</td>
      <td>52.096165</td>
      <td>52.096165</td>
      <td>15361800</td>
    </tr>
    <tr>
      <th>4</th>
      <td>2004-08-25</td>
      <td>52.140873</td>
      <td>53.651051</td>
      <td>51.604362</td>
      <td>52.657513</td>
      <td>52.657513</td>
      <td>9257400</td>
    </tr>
  </tbody>
</table>
</div>

In [58]:
google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

#### Functions

* data.groupby(['Year'])['Salary'].sum()